package ru.croc.ugd.ssr.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

import java.util.Arrays;
import java.util.Optional;

@Getter
@AllArgsConstructor
public enum DistrictCode {

    _001("муниципальный округ Академический", "Академический", "001"),
    _002("муниципальный округ Алексеевский", "Алексеевский", "002"),
    _003("муниципальный округ Алтуфьевский", "Алтуфьевский", "003"),
    _004("муниципальный округ Арбат", "Арбат", "004"),
    _005("муниципальный округ Аэропорт", "Аэропорт", "005"),
    _006("муниципальный округ Бабушкинский", "Бабушкинский", "006"),
    _007("муниципальный округ Басманный", "Басманный", "007"),
    _008("муниципальный округ Беговой", "Беговой", "008"),
    _009("муниципальный округ Бескудниковский", "Бескудниковский", "009"),
    _010("муниципальный округ Бибирево", "Бибирево", "010"),
    _011("муниципальный округ Бирюлёво Восточное", "Бирюлёво Восточное", "011"),
    _012("муниципальный округ Бирюлёво Западное", "Бирюлёво Западное", "012"),
    _013("муниципальный округ Богородское", "Богородское", "013"),
    _014("муниципальный округ Братеево", "Братеево", "014"),
    _015("муниципальный округ Бутырский", "Бутырский", "015"),
    _016("муниципальный округ Вешняки", "Вешняки", "016"),
    _017("муниципальный округ Внуково", "Внуково", "017"),
    _018("муниципальный округ Войковский", "Войковский", "018"),
    _019("муниципальный округ Восточный", "Восточный", "019"),
    _020("муниципальный округ Восточное Дегунино", "Восточное Дегунино", "020"),
    _021("муниципальный округ Восточное Измайлово", "Восточное Измайлово", "021"),
    _022("муниципальный округ Выхино-Жулебино", "Выхино-Жулебино", "022"),
    _023("муниципальный округ Гагаринский", "Гагаринский", "023"),
    _024("муниципальный округ Головинский", "Головинский", "024"),
    _025("муниципальный округ Гольяново", "Гольяново", "025"),
    _026("муниципальный округ Даниловский", "Даниловский", "026"),
    _027("муниципальный округ Дмитровский", "Дмитровский", "027"),
    _028("муниципальный округ Донской", "Донской", "028"),
    _029("муниципальный округ Дорогомилово", "Дорогомилово", "029"),
    _030("муниципальный округ Замоскворечье", "Замоскворечье", "030"),
    _031("муниципальный округ Западное Дегунино", "Западное Дегунино", "031"),
    _032("муниципальный округ Зюзино", "Зюзино", "032"),
    _033("муниципальный округ Зябликово", "Зябликово", "033"),
    _034("муниципальный округ Ивановское", "Ивановское", "034"),
    _035("муниципальный округ Измайлово", "Измайлово", "035"),
    _036("муниципальный округ Капотня", "Капотня", "036"),
    _037("муниципальный округ Коньково", "Коньково", "037"),
    _038("муниципальный округ Коптево", "Коптево", "038"),
    _039("муниципальный округ Косино-Ухтомский", "Косино-Ухтомский", "039"),
    _040("муниципальный округ Котловка", "Котловка", "040"),
    _041("муниципальный округ Красносельский", "Красносельский", "041"),
    _042("муниципальный округ Крылатское", "Крылатское", "042"),
    _043("муниципальный округ Крюково", "Крюково", "043"),
    _044("муниципальный округ Кузьминки", "Кузьминки", "044"),
    _045("муниципальный округ Кунцево", "Кунцево", "045"),
    _046("муниципальный округ Куркино", "Куркино", "046"),
    _047("муниципальный округ Левобережный", "Левобережный", "047"),
    _048("муниципальный округ Лефортово", "Лефортово", "048"),
    _049("муниципальный округ Лианозово", "Лианозово", "049"),
    _050("муниципальный округ Ломоносовский", "Ломоносовский", "050"),
    _051("муниципальный округ Лосиноостровский", "Лосиноостровский", "051"),
    _052("муниципальный округ Люблино", "Люблино", "052"),
    _053("муниципальный округ Марфино", "Марфино", "053"),
    _054("муниципальный округ Марьина Роща", "Марьина Роща", "054"),
    _055("муниципальный округ Марьино", "Марьино", "055"),
    _056("муниципальный округ Матушкино", "Матушкино", "056"),
    _057("муниципальный округ Метрогородок", "Метрогородок", "057"),
    _058("муниципальный округ Мещанский", "Мещанский", "058"),
    _059("муниципальный округ Митино", "Митино", "059"),
    _060("муниципальный округ Можайский", "Можайский", "060"),
    _061("муниципальный округ Молжаниновский", "Молжаниновский", "061"),
    _062("муниципальный округ Москворечье-Сабурово", "Москворечье-Сабурово", "062"),
    _063("муниципальный округ Нагатино-Садовники", "Нагатино-Садовники", "063"),
    _064("муниципальный округ Нагатинский Затон", "Нагатинский Затон", "064"),
    _065("муниципальный округ Нагорный", "Нагорный", "065"),
    _066("муниципальный округ Некрасовка", "Некрасовка", "066"),
    _067("муниципальный округ Нижегородский", "Нижегородский", "067"),
    _068("муниципальный округ Новогиреево", "Новогиреево", "068"),
    _069("муниципальный округ Новокосино", "Новокосино", "069"),
    _070("муниципальный округ Ново-Переделкино", "Ново-Переделкино", "070"),
    _071("муниципальный округ Обручевский", "Обручевский", "071"),
    _072("муниципальный округ Орехово-Борисово Северное", "Орехово-Борисово Северное", "072"),
    _073("муниципальный округ Орехово-Борисово Южное", "Орехово-Борисово Южное", "073"),
    _074("муниципальный округ Останкинский", "Останкинский", "074"),
    _075("муниципальный округ Отрадное", "Отрадное", "075"),
    _076("муниципальный округ Очаково-Матвеевское", "Очаково-Матвеевское", "076"),
    _077("муниципальный округ Перово", "Перово", "077"),
    _078("муниципальный округ Печатники", "Печатники", "078"),
    _079("муниципальный округ Покровское-Стрешнево", "Покровское-Стрешнево", "079"),
    _080("муниципальный округ Преображенское", "Преображенское", "080"),
    _081("муниципальный округ Пресненский", "Пресненский", "081"),
    _082("муниципальный округ Проспект Вернадского", "Проспект Вернадского", "082"),
    _083("муниципальный округ Раменки", "Раменки", "083"),
    _084("муниципальный округ Ростокино", "Ростокино", "084"),
    _085("муниципальный округ Рязанский", "Рязанский", "085"),
    _086("муниципальный округ Савёлки", "Савёлки", "086"),
    _087("муниципальный округ Савёловский", "Савёловский", "087"),
    _088("муниципальный округ Свиблово", "Свиблово", "088"),
    _089("муниципальный округ Северный", "Северный", "089"),
    _090("муниципальный округ Северное Бутово", "Северное Бутово", "090"),
    _091("муниципальный округ Северное Измайлово", "Северное Измайлово", "091"),
    _092("муниципальный округ Северное Медведково", "Северное Медведково", "092"),
    _093("муниципальный округ Северное Тушино", "Северное Тушино", "093"),
    _094("муниципальный округ Силино", "Силино", "094"),
    _095("муниципальный округ Сокол", "Сокол", "095"),
    _096("муниципальный округ Соколиная Гора", "Соколиная Гора", "096"),
    _097("муниципальный округ Сокольники", "Сокольники", "097"),
    _098("муниципальный округ Солнцево", "Солнцево", "098"),
    _099("муниципальный округ Старое Крюково", "Старое Крюково", "099"),
    _100("муниципальный округ Строгино", "Строгино", "100"),
    _101("муниципальный округ Таганский", "Таганский", "101"),
    _102("муниципальный округ Тверской", "Тверской", "102"),
    _103("муниципальный округ Текстильщики", "Текстильщики", "103"),
    _104("муниципальный округ Тёплый Стан", "Тёплый Стан", "104"),
    _105("муниципальный округ Тимирязевский", "Тимирязевский", "105"),
    _106("муниципальный округ Тропарёво-Никулино", "Тропарёво-Никулино", "106"),
    _107("муниципальный округ Филёвский Парк", "Филёвский Парк", "107"),
    _108("муниципальный округ Фили-Давыдково", "Фили-Давыдково", "108"),
    _109("муниципальный округ Хамовники", "Хамовники", "109"),
    _110("муниципальный округ Ховрино", "Ховрино", "110"),
    _111("муниципальный округ Хорошёво-Мнёвники", "Хорошёво-Мнёвники", "111"),
    _112("муниципальный округ Хорошёвский", "Хорошёвский", "112"),
    _113("муниципальный округ Царицыно", "Царицыно", "113"),
    _114("муниципальный округ Черёмушки", "Черёмушки", "114"),
    _115("муниципальный округ Чертаново Северное", "Чертаново Северное", "115"),
    _116("муниципальный округ Чертаново Центральное", "Чертаново Центральное", "116"),
    _117("муниципальный округ Чертаново Южное", "Чертаново Южное", "117"),
    _118("муниципальный округ Щукино", "Щукино", "118"),
    _119("муниципальный округ Южное Бутово", "Южное Бутово", "119"),
    _120("муниципальный округ Южное Медведково", "Южное Медведково", "120"),
    _121("муниципальный округ Южное Тушино", "Южное Тушино", "121"),
    _122("муниципальный округ Южнопортовый", "Южнопортовый", "122"),
    _123("муниципальный округ Якиманка", "Якиманка", "123"),
    _124("муниципальный округ Ярославский", "Ярославский", "124"),
    _125("муниципальный округ Ясенево", "Ясенево", "125"),
    _126("городской округ Троицк", "Троицк", "126"),
    _127("городской округ Щербинка", "Щербинка", "127"),
    _128("поселение Внуковское", "Внуковское", "128"),
    _129("поселение Вороновское", "Вороновское", "129"),
    _130("поселение Воскресенское", "Воскресенское", "130"),
    _131("поселение Десеновское", "Десёновское", "131"),
    _132("поселение Киевский", "Киевский", "132"),
    _133("поселение Клёновское", "Клёновское", "133"),
    _134("поселение Кокошкино", "Кокошкино", "134"),
    _135("поселение Краснопахорское", "Краснопахорское", "135"),
    _136("поселение Марушкинское", "Марушкинское", "136"),
    _137("поселение Михайлово-Ярцевское", "Михайлово-Ярцевское", "137"),
    _138("поселение Московский", "Московский", "138"),
    _139("поселение \"Мосрентген\"", "Мосрентген", "139"),
    _140("поселение Новофёдоровское", "Новофёдоровское", "140"),
    _141("поселение Первомайское", "Первомайское", "141"),
    _142("поселение Роговское", "Роговское", "142"),
    _143("поселение Рязановское", "Рязановское", "143"),
    _144("поселение Сосенское", "Сосенское", "144"),
    _145("поселение Филимонковское", "Филимонковское", "145"),
    _146("поселение Щаповское", "Щаповское", "146");

    private final String name;
    private final String ccoName;
    private final String code;

    public static Optional<DistrictCode> ofCode(final String code) {
        return Arrays.stream(values())
            .filter(source -> source.getCode().equals(code))
            .findFirst();
    }

    public static Optional<DistrictCode> ofCcoName(final String ccoName) {
        return Arrays.stream(values())
            .filter(source -> source.getCcoName().equals(ccoName))
            .findFirst();
    }

    public static Optional<DistrictCode> ofName(final String name) {
        return Arrays.stream(values())
            .filter(source -> source.getName().equals(name))
            .findFirst();
    }
}
